app/views/pages/_cart.html.erb

<h2>Cart:</h2>
<% @dishes = Dish.all %>
---
SELECT "dishes".* FROM "dishes"