app/controllers/pages_controller.rb

SELECT "rests".* FROM "rests"
---
	def rests
		@rests = Rest.all

SELECT  "rests".* FROM "rests" WHERE "rests"."id" = ? LIMIT ?  [["id", 0], ["LIMIT", 1]]
SELECT "categories".* FROM "categories" WHERE "categories"."rest_id" = ?  [["rest_id", 1]]
---
	def dishes
		@rest = Rest.find(params[:id])
		@categories = @rest.categories.to_a

SELECT  "carts".* FROM "carts" ORDER BY "carts"."id" DESC LIMIT ?  [["LIMIT", 1]]
INSERT INTO "carts" ("created_at", "updated_at") VALUES (?, ?)  [["created_at", 2016-09-02 13:46:15 UTC], ["updated_at", 2016-09-02 13:46:15 UTC]]
SELECT  "dishes".* FROM "dishes" WHERE "dishes"."id" = ? LIMIT ?  [["id", 0], ["LIMIT", 1]]
UPDATE "carts" SET "cur_rest" = ?, "updated_at" = ? WHERE "carts"."id" = ?  [["cur_rest", 1], ["updated_at", 2016-09-02 13:46:15 UTC], ["id", 1]]
UPDATE "dishes" SET "counter" = ?, "updated_at" = ? WHERE "dishes"."id" = ?  [["counter", 1], ["updated_at", 2016-09-02 13:13:35 UTC], ["id", 1]]
DELETE FROM "carts" WHERE "carts"."id" = ?  [["id", 1]]
---
	def adder
		if Cart.last == nil
			@cart = Cart.create()
		end
  	@cart = Cart.last
		@dish = Dish.find(params[:format])
		if @dish.counter == nil
      @dish.counter = 0
    end
    if @dish.rest.id == @cart.cur_rest || @cart.cur_rest == nil
    	@cart.cur_rest = @dish.rest.id.to_i
    	@cart.save
    else
    	flash[:danger] = "You have added a dish from another restaurant. Your cart has been reset."
    	@cart.destroy

SELECT  "dishes".* FROM "dishes" WHERE "dishes"."id" = ? LIMIT ?  [["id", 0], ["LIMIT", 1]]
UPDATE "dishes" SET "counter" = ?, "updated_at" = ? WHERE "dishes"."id" = ?  [["counter", 0], ["updated_at", 2016-09-02 13:17:24 UTC], ["id", 1]]
---
	def deleter
		@dish = Dish.find(params[:format])
		@dish.counter = 0
		@dish.save

SELECT "dishes".* FROM "dishes"
UPDATE "dishes" SET "counter" = ?, "updated_at" = ? WHERE "dishes"."id" = ?  [["counter", 0], ["updated_at", 2016-09-02 13:18:52 UTC], ["id", 2]]
SELECT  "rests".* FROM "rests" WHERE "rests"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
	def alldeleter
		@dishes = Dish.all
		@dishes.each do |dish|
			dish.counter = 0
			dish.save
		end
		redirect_to forest_show_path(@dishes.first.rest.id)